{"id": "87hvp1", "user": "lopery", "root": "87hvp1", "reply_to": null, "timestamp": 1522152580, "text": "Hey girls, for all girls that want **fashion shoes for women 2018**. I know it sure can be hard to find a nice fashionable pair of women's shoes in 2018 that are affordable and just fit you perfectly! Sure, you can get shoes in your size, that will help! But when it comes to the latest stylish fashion shoes for women then you should first check out this for [fashion shoes for women 2018](https://www.youtube.com/watch?v=eI5UOZwArBw). This great video has the latest stylish fashion shoes for Women. Find comfortable shoes and footwear for 2018. Sale event on! As found on the My Optimum Style YouTube channel. Enjoy and happy shoe shopping ladies!", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1522364178, "gilded": 0, "gildings": null, "subreddit": "fashionshoesforwomen", "stickied": false, "permalink": "/r/fashionshoesforwomen/comments/87hvp1/fashion_shoes_for_women_2018/", "author_flair_text": ""}}
{"id": "88i85j", "user": "lopery", "root": "88i85j", "reply_to": null, "timestamp": 1522498192, "text": "Hi my girls, sometimes you just want a **comfortable shoes for women 2018** regardless to the cost or style of them am I right? Can I get an Amen? lol.. Well I know what it's like, I sometimes like to go for fashionable and stylish shoes. However at the expenses of comfort! I'll literally tear my feet to shreds just to look good but that's not good! Lately I've been trying out some comfortable shoes for women 2018 and I've found this video on YouTube that has a great list of [comfortable shoes for women 2018](https://www.youtube.com/watch?v=eI5UOZwArBw). I'm sure once you see these shoes though you'll realize that it's not all about being fashionable and stylish and keeping up with the Jones'. Who cares about that when your feet are comfortable?", "meta": {"score": 1, "top_level_comment": null, "retrieved_on": 1523410461, "gilded": 0, "gildings": null, "subreddit": "fashionshoesforwomen", "stickied": false, "permalink": "/r/fashionshoesforwomen/comments/88i85j/comfortable_shoes_for_women_2018/", "author_flair_text": ""}}
